export default {
  namespaced: true,
  state: {
    results_protocol: {
      layout: {
        padding: {
          value: 5,
          mu: "mm"
        },
        header: {
          height: 160
        },
        footer: {
          height: 160
        }
      },
      assets: {
        header_logo: null,
        footer_logo: null
      }
    },
    start_list: {},
    testResults: [
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },
          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "102",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },
          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "103",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },
          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "104",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },
          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "105",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },
          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "106",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },
          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "107",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },
          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "108",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "109",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "110",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "111",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "112",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "113",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "114",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "115",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "116",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "117",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "118",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "119",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "120",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "121",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "122",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "123",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "124",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "125",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "126",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "127",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "128",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "129",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "130",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "131",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "132",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "133",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "134",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "135",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "136",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "137",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "138",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "139",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "140",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "141",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "142",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "143",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "144",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "145",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "146",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "147",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "148",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "149",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "150",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "151",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "152",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "153",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "154",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "155",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "156",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "157",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "158",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "159",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      }
    ]
  },
  getters: {
    results_protocol: state => state.results_protocol,
    testResults: state => state.testResults
  },
  mutations: {
    setHeader: (state, event) => {
      state.results_protocol.assets.header_logo = event.target.files[0];
      console.log(state.results_protocol);
    },
    setFooter: (state, event) => {
      state.results_protocol.assets.footer_logo = event.target.files[0];
      console.log(state.results_protocol);
    }
  }
};
