export default {
  namespaced: true,
  state: {
    results_protocol: {
      layout: {
        padding: {
          value: 5,
          mu: "mm"
        }
      }
    },
    start_list: {},
    testResults: [
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      },
      {
        bib: "101",
        year: "1982",
        name: "Иван",
        surname: "Проверочный",
        runs: [
          {
            run: "Заезд 1",
            marks: [43.6, 46, 34, 48, 50.5]
          },

          {
            run: "Заезд 2",
            marks: [43.6, 46, 34, 48, 50.5]
          }
        ]
      }
    ]
  },
  getters: {
    results_protocol: state => state.results_protocol,
    testResults: state => state.testResults
  },
  mutations: {}
};
